// Напишите программу, которая принимает на вход пятизначное число
// и проверяет, является ли оно палиндромом.
// 14212 -> нет
// 12821 -> да
// 23432 -> да.

Console.WriteLine("введите пятизначное число: ");
int five = Convert.ToInt32(Console.ReadLine());

// if (five < 10000 || five > 99999)
// {
//     Console.WriteLine ("введено не пятизначное число");
// }

// else if ()
// {
    
// }

// решения пока нет